{
    "common": {
        "translation": {
            "Author": "Andrii Larionov",
            "Terminal1": "Hello. My name is Andrii. I am 20 years old. I am Full Stack JS Developer. 4 years in web development including 3 years of commercial experience. Go down and see my tech stack, which I use to build apps.",
            "TechesStack": "Development stack",
            "year1": "year",
            "year2": "years",
            "year3": "years",
            "exp": "exp.",
            "typescript": "TypeScript on Front End and Back End",
            "GitHub": "This is a link to my GitHub. There you can get familiar with projects I have done. If necessary I am ready to do a test task.",
            "Contacts": "Contacts"
        }
    },
    "commercial-experience": {
        "translation": {
            "commercialExp": "Commercial experience",
            "partTime": "part-time",
            "fullTime": "full-time",
            "project": "project",

            "jobPlace1Description": "Participated in team development of Back End of crypto exchange. Building REST API for managing system entities. Writing controllers functions, services functions and models functions",
            "jobPlace1Term": "6 months",

            "jobPlace2Description": "I participated in CRM development. Authorization via Google OAuth2.0 using Passport.js library. Building REST API which perform CRUD of CRM entities. Writing REST API for Google Doc creating on Google Drive using Google Drive API. Writing functions in Google Apps Script to merge few Google Docs into one and table adding to end of specified Google Doc. Docker Compose build three services: Front End (Vue), Back End (Node.js), DB (MySQL)",
            "jobPlace2Term": "2 months",

            "jobPlace3Description": "Development of new college site (SSR: JS, Node.js+Express, ejs), admimistration and support. Adaptive layout. Authorization via sessions using Passport.js library. 2FA-authorization via telegram bot (Telegraf library). Google Auth. Admin Page to manage moderators, articles and news. Storing files at Google Drive",
            "jobPlace3Term": "1 year",

            "jobPlace4Description": "Call-center software. Microservice architecture.",
            "jobPlace4Term": "1 year",

            "jobPlace5Description": "Project \"Law Quest\": Trainer for students of law university. Admin Page for managing game elements. Text game.",
            "jobPlace5Term": "6 months"
        }
    }
}
