{
    "common": {
        "translation": {
            "Author": "Андрій Ларіонов",
            "Terminal1": "Вітаю. Мене звуть Андрій. Мені 21 рік. Я Full Stack JS Developer. 4 роки у веб-розробці включаючи 3 роки комерційного досвіду. Далі представляю вам стек, який я використовую.",
            "TechesStack": "Стек технологій",
            "year1": "рік",
            "year2": "роки",
            "year3": "років",
            "exp": "досвіду",
            "typescript": "TypeScript на Front End та Back End",
            "GitHub": "Це посилання на мій GitHub. Там Ви можете ознайомитись з проектами, які я виконував. При необхідності готовий виконати тестове завдання.",
            "Contacts": "Контакти"
        }
    },
    "commercial-experience": {
        "translation": {
            "commercialExp": "Комерційний досвід",
            "partTime": "Часткова зайнятість",
            "fullTime": "Повна зайнятість",
            "project": "Проектна зайнятість",

            "jobPlace1Description": "Участь у командній розробці Back End для криптовалютної біржи. Будування REST API для CRUD сутностей системи. Написання функцій-контролерів, функцій-сервісів та функцій-моделей",
            "jobPlace1Term": "6 місяців",

            "jobPlace2Description": "Участь у розробці CRM-системи. Авторизація через Google OAuth2.0 за допомогую бібліотеки Passport.js. Будування REST API, який реалізує CRUD сутностей CRM. Написання REST API для створення Google Doc на Google диску, використувуючи Google Drive API. Написання функцій в Google Apps Script для злиття декількох Google Doc в один і добавлення таблиці у кінець вказанного Google Doc. Docker Compose трьох сервісів: Front End (Vue), Back End (Node.js), DB (MySQL)",
            "jobPlace2Term": "2 місяці",

            "jobPlace3Description": "Розробка нового сайту коледжу, його адміністрування та підтримка. Адаптивна верстка. Авторизація через сессії, використовуючи библиотеку Passport.js. Авторизація 2FA через телеграм-бота (бібліотека Telegraf). Авторизація через Google. Сторінка адміністратора для керування модераторами, статтями та новинами. Зберігання файлів на Google Drive",
            "jobPlace3Term": "1 рік",

            "jobPlace4Description": "Програмне забезпечення для кол-центрів. Мікросервісна архітектура.",
            "jobPlace4Term": "1 рік",

            "jobPlace5Description": "Проект \"Law Quest\": Тренажер для студентів юридичного університету. Сторінка адміністратора для керування елементами гри. Текстова гра.",
            "jobPlace5Term": "6 місяців"
        }
    }
}
